import styles from './PrivacyPage.module.css';
import { Title } from '../../common/Title/Title';
const PrivacyPage = () => {
  return (
    <div className={styles.container}>
      <div className={styles.wrapperPrivacy}>
        <span className={styles.dateOfUpdate}>Последнее обновление: 26 мая 2024 года</span>
        <Title title="Политика конфиденциальности" />
        <p>
          Эта Политика конфиденциальности описывает наши политики и процедуры в отношении сбора,
          использования и раскрытия Вашей информации при использовании Сервиса и информирует Вас о
          Ваших правах на конфиденциальность и о том, как закон защищает Вас.
        </p>
        <p>
          Мы используем Ваши персональные данные для предоставления и улучшения Сервиса. Используя
          Сервис, Вы соглашаетесь на сбор и использование информации в соответствии с этой Политикой
          конфиденциальности.
        </p>
        <h2>Интерпретация и Определения</h2>
        <h3>Интерпретация</h3>
        <p>
          Слова, начальная буква которых написана с заглавной буквы, имеют значения, определенные
          при следующих условиях. Следующие определения имеют одинаковое значение независимо от
          того, употребляются ли они в единственном или множественном числе.
        </p>
        <h3>Определения</h3>
        <p>Для целей настоящей Политики конфиденциальности:</p>
        <ul>
          <li>
            Учетная запись означает уникальную учетную запись, созданную для доступа к нашему
            Сервису или частям нашего Сервиса.
          </li>
          <li>
            Компания (именуемая в настоящем Соглашении "Компания", "Мы", "Мы" или "Мы") относится к
            Molly.
          </li>
          <li>
            Куки - это небольшие файлы, которые размещаются на Вашем компьютере, мобильном
            устройстве или любом другом устройстве на веб-сайте, содержащем подробную информацию о
            Вашей истории просмотра на этом веб-сайте среди его многих применений.
          </li>
          <li>Страна, о которой идет речь: Беларусь.</li>
          <li>
            Устройство означает любое устройство, которое может получить доступ к Сервису, например
            компьютер, мобильный телефон или цифровой планшет.
          </li>
          <li>
            Персональные данные - это любая информация, относящаяся к идентифицированному или
            идентифицируемому лицу.
          </li>
          <li>Сервис ссылается на Сайт.</li>
          <li>
            Данные об использовании — это данные, собираемые автоматически, либо генерируемые в
            результате использования Сервиса, либо из самой инфраструктуры Сервиса (например,
            продолжительность посещения страницы).
          </li>
          <li>
            Вы означает физическое лицо, получающее доступ к Сервису или использующее его, или
            компанию или другое юридическое лицо, от имени которого такое физическое лицо получает
            доступ к Сервису или использует его, в зависимости от обстоятельств.
          </li>
        </ul>
        <h2>Сбор и использование Ваших персональных данных</h2>
        <h3>Типы собираемых данных</h3>
        <h4>Персональные данные</h4>
        <p>
          При использовании нашего Сервиса мы можем попросить вас предоставить нам определенную
          личную информацию, которая может быть использована для связи или идентификации вас. Личная
          информация может включать, помимо прочего:
        </p>
        <ul>
          <li>Почта</li>
          <li>Имя</li>
          <li>Номер телефона</li>
          <li>Адрес</li>
          <li>Данные использования</li>
        </ul>
        <h4>Данные использования</h4>
        <p>
          При использовании нашего Сервиса мы можем также автоматически собирать определенную
          информацию, которая создается или регистрируется автоматически при использовании Сервиса
          ("Данные использования"). Эти данные могут включать информацию, такую как IP-адрес вашего
          компьютера, тип браузера, версия браузера, страницы Сервиса, которые вы посещаете, время и
          дата вашего посещения, время, проведенное на этих страницах, уникальные идентификаторы
          устройств и другие диагностические данные.
        </p>
        <p>
          Мы также можем собирать информацию, которую ваш браузер отправляет при доступе к нашему
          Сервису или при использовании Сервиса вашим устройством.
        </p>
        <h2>Технологии отслеживания и куки</h2>
        <p>
          Мы используем куки и аналогичные технологии отслеживания для отслеживания активности
          нашего Сервиса и хранения определенной информации. Используемые технологии отслеживания
          включают маяки, теги и сценарии для сбора и отслеживания информации и для улучшения и
          анализа нашего Сервиса.
        </p>
        <p>
          Куки — это небольшие файлы, размещаемые на вашем устройстве. Вы можете настроить ваш
          браузер так, чтобы он отказывался от всех куки или указывал вам, когда куки отправляются.
          Однако, если вы не принимаете куки, вы можете не иметь доступ ко всем частям нашего
          Сервиса. Если вы не настроите ваш браузер на отказ от куки, наш Сервис может использовать
          куки.
        </p>
        <p>Мы используем как сеансовые, так и постоянные куки для целей, указанных ниже:</p>
        <ul>
          <li>
            Куки, необходимые / существенные. Такие куки необходимы для предоставления вам услуг,
            доступных через Сайт, и для предоставления вам некоторых его функций. Они помогают
            аутентифицировать пользователей и предотвращать мошенническое использование учетных
            записей пользователей. Без этих куки мы не сможем предоставить вам запрошенные услуги, и
            мы используем их только для предоставления вам этих услуг.
          </li>
          <li>
            Куки политики / уведомления о куки. Эти куки определяют, приняли ли пользователи
            использование куки на Сайте.
          </li>
          <li>
            Функциональные куки. Эти куки позволяют нам запоминать выборы, которые вы делаете при
            использовании Сайта, такие как запоминание ваших данных для входа или предпочтений
            языка. Цель этих куки - предоставить вам более персонализированный опыт и избежать
            необходимости повторного ввода ваших предпочтений каждый раз, когда вы используете Сайт.
          </li>
        </ul>
        <h2>Хранение ваших личных данных</h2>
        <p>
          Компания будет хранить Ваши Персональные данные только до тех пор, пока это необходимо для
          целей, изложенных в этой Политике конфиденциальности. Мы будем использовать ваши данные
          для соблюдения юридических обязательств, разрешения споров и обеспечения выполнения наших
          соглашений и политик.
        </p>
        <p>
          Данные об использовании хранятся для внутреннего анализа на более короткий период, за
          исключением случаев повышения безопасности или улучшения функциональности нашего Сервиса,
          либо если мы обязаны хранить их дольше по закону.
        </p>
        <h3>Передача ваших личных данных</h3>{' '}
        <p>
          Ваша информация, включая Персональные данные, обрабатывается в операционных офисах
          Компании и других местах, где находятся участники обработки. Это означает, что она может
          передаваться и храниться за пределами вашей юрисдикции, где законы о защите данных могут
          отличаться.
        </p>
        <p>
          Ваше согласие с этой Политикой конфиденциальности и предоставление информации означает
          Ваше согласие на такую передачу.
        </p>
        <p>
          Компания предпримет все необходимые меры для обеспечения безопасного обращения с Вашими
          данными в соответствии с этой Политикой конфиденциальности, и никакая передача
          Персональных данных не будет осуществляться без адекватных мер контроля, включая
          безопасность данных.
        </p>
        <h2>Удалить ваши личные данные</h2>
        <p>Вы имеете право удалить или попросить нас помочь удалить Ваши Персональные данные.</p>
        <p>Наш Сервис может предоставить Вам возможность удалить определенную информацию о Вас.</p>
        <p>
          Вы можете обновить, изменить или удалить свою информацию в любое время, войдя в свою
          учетную запись и посетив раздел настроек. Вы также можете связаться с нами для доступа,
          исправления или удаления предоставленной Вами информации.
        </p>
        <p>
          Обратите внимание, что нам может потребоваться сохранить определенную информацию, если у
          нас есть юридическое обязательство или законное основание.
        </p>
        <p>
          Для получения дополнительной информации о куки, которые мы используем, и о ваших выборах в
          отношении куки, пожалуйста, ознакомьтесь с нашей Политикой использования
        </p>
      </div>
    </div>
  );
};

export default PrivacyPage;
